# python for-in循环

# 求数字30-80之间 奇数和 与 偶数和

num_1 = 0 #定义奇数和变量
num_2 = 0 #定义偶数和变量
for X_1 in range (30,81,1):
    
    if X_1 % 2 != 0 : 
        
        num_1 += X_1  # 奇数和
    
    else: 
        num_2 += X_1  # 偶数和

print (f'数字30-80之间的奇数和为 {num_1}，偶数和为 {num_2}')


# 求数字30-50之间偶数的积

num_3 = 1

for X_3 in range (30,51,2):
    num_3 *= X_3

print (f'数字30-50之间偶数的积为 {num_3}')


# 求数字200-300之间除了7的倍数之外数字的和

num_4 = 0
for X_4 in range (200,301,1):
    
    if X_4 % 7 != 0: # 非7的倍数除以7的余数不为 0
        num_4 += X_4  # 如果变量 X_4 除以7后余数不为0，则为非7的倍数，将进入变量 num_4 = num_4 + X_4 运算
    
print (f'数字200-300之间除了7的倍数之外数字的和为 {num_4}')



# 求数字100-999之间有多少个水仙花数

num_5 = 0
for X_5 in range (100,1000,1):

  # 定义 个、十、百位数取值数学逻辑
    ge = X_5 % 10
    shi = X_5 // 10 % 10
    bai = X_5 // 100

    if ge**3 + shi**3 + bai**3 == X_5:
        num_5 += 1 # 遍历数字100-999，其中每遍历到1个符合水仙花数定义的，变量 num_5 数值加1，最终确定数量
        print ( X_5 ) # 输出根据变量定义遍历出的水仙花数

print (f'数字100-999之间的水仙花数共有 {num_5} 个')