# 要求用户输入一个数（该数字要求为介于100-999之间的一个3位数，包含100和999），判断该数字是否为“水仙花数”；
# 水仙花数定义：例-153=3*3*3+5*5*5+1*1*1

# 分别取个、十、百位数的数学逻辑 ge =num%10  shi=num//10%10  bai=num//100
# 数字100-999间的4个明确水仙花数为：153 370 371 407

print ('# python_Project-水仙花数判断 #')

num = int (input('请输入一个介于100-999间的三位数（不包含100和999）：'))

ge = num % 10
shi = num // 10 % 10
bai = num // 100

if num <= 100 or num >= 999:
   
   print (f'数字({num})不满足条件！')

elif num == ge ** 3 + shi ** 3 + bai ** 3:
   
   print (f'数字({num})为水仙花数')

else:
   
   print (f'数字({num})不是水仙花数')